testing/axiom-testsuite/src/main/resources/badsoap/soap12/entity-reference.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
    <soapenv:Body>
        <ns:echo xmlns:ns="urn:test">
            &entityref;
        </ns:echo>
    </soapenv:Body>
</soapenv:Envelope>