systests/spring-ws-tests/src/test/resources/org/apache/axiom/systest/springws/soap-message.xml

<?xml version='1.0'?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Header>
        <p:myHeader xmlns:p="urn:test">value</p:myHeader>
    </env:Header>
    <env:Body>
        <p:echo xmlns:p="urn:test">hi!</p:echo>
    </env:Body>
</env:Envelope>