modules/axiom-testsuite/src/main/resources/badsoap/soap11/processing-instruction.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <ns:echo xmlns:ns="urn:test">
            <?pi some processing instruction?>
        </ns:echo>
    </soapenv:Body>
</soapenv:Envelope>